Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>multiformats</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository_file.this["github-mgmt/codeowners"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "github-mgmt" # forces replacement
      ~ commit_sha          = "2c9a391a995ae8f67c227dc7b27607bf424d7c92" -> (known after apply)
      ~ id                  = "github-mgmt/CODEOWNERS" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "3e440ede783e7c1ded461c2626fc9d9be325b777" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["java-multiaddr/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "java-multiaddr" # forces replacement
      ~ commit_sha          = "bc7bfcaed828a5243335d1827960361702843c3a" -> (known after apply)
      ~ id                  = "java-multiaddr/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "5ace4600a1f26e6892982f3e2f069ebfab108d87" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["java-multibase/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "java-multibase" # forces replacement
      ~ commit_sha          = "c24ec1bef31ab3a33bab025199c8a729df496777" -> (known after apply)
      ~ id                  = "java-multibase/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "5ace4600a1f26e6892982f3e2f069ebfab108d87" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["java-multihash/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "java-multihash" # forces replacement
      ~ commit_sha          = "89d2eab1016a3af01ea4b845cd7ec967fe092275" -> (known after apply)
      ~ id                  = "java-multihash/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "5ace4600a1f26e6892982f3e2f069ebfab108d87" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["js-blake2/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "js-blake2" # forces replacement
      ~ commit_sha          = "58ad5e0d56486253f765159d8bd6718a4c99d481" -> (known after apply)
      ~ id                  = "js-blake2/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "0bc3b42de80649fff0f1459ed1fb8311fd38fe50" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["js-multiformats/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "js-multiformats" # forces replacement
      ~ commit_sha          = "aa9c7303a7bd844d659163261d301c5c95f26c3b" -> (known after apply)
      ~ id                  = "js-multiformats/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "2d5b8620c03fc5598c057483ca9cc9ff8bbecabf" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["js-sha3/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "js-sha3" # forces replacement
      ~ commit_sha          = "3745435d4631692b63f52e832592b4bb769f67b9" -> (known after apply)
      ~ id                  = "js-sha3/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "0bc3b42de80649fff0f1459ed1fb8311fd38fe50" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["multiaddr/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "multiaddr" # forces replacement
      ~ commit_sha          = "5a179104a6f9e9a2c95562496c88bf514871a1d3" -> (known after apply)
      ~ id                  = "multiaddr/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "5ace4600a1f26e6892982f3e2f069ebfab108d87" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["multicodec/codeowners"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "multicodec" # forces replacement
      ~ commit_sha          = "d06fc6194710e8909bac64273c43f16b56ca4c34" -> (known after apply)
      ~ id                  = "multicodec/CODEOWNERS" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "0972bd12440639c463ed7687700f949b5c3779df" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["rust-cid/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "rust-cid" # forces replacement
      ~ commit_sha          = "a0ba4e9e9eb956802f0a1be4934558b02181526b" -> (known after apply)
      ~ id                  = "rust-cid/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "1116676996a3cd7f70ec8e3dbb7e1c28e6fc410f" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["rust-multiaddr/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "rust-multiaddr" # forces replacement
      ~ commit_sha          = "2ee358c4d7801731cf97b04dbb7d40d6cab06b30" -> (known after apply)
      ~ id                  = "rust-multiaddr/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "1116676996a3cd7f70ec8e3dbb7e1c28e6fc410f" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["rust-multibase/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "rust-multibase" # forces replacement
      ~ commit_sha          = "74024332ed1dade01f20ed4137665621a38ba392" -> (known after apply)
      ~ id                  = "rust-multibase/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "1116676996a3cd7f70ec8e3dbb7e1c28e6fc410f" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.this["rust-multihash/.github/dependabot.yml"] must be replaced
-/+ resource "github_repository_file" "this" {
      ~ branch              = "master" -> "rust-multihash" # forces replacement
      ~ commit_sha          = "71da2942e2dec458709e7b64c363f1ff57a895c7" -> (known after apply)
      ~ id                  = "rust-multihash/.github/dependabot.yml" -> (known after apply)
      ~ ref                 = "master" -> (known after apply)
      ~ sha                 = "1116676996a3cd7f70ec8e3dbb7e1c28e6fc410f" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_team_membership.this["github-mgmt stewards:aschmahmann"] will be updated in-place
  ~ resource "github_team_membership" "this" {
        id       = "6630975:aschmahmann"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.this["github-mgmt stewards:rvagg"] will be updated in-place
  ~ resource "github_team_membership" "this" {
        id       = "6630975:rvagg"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.this["github-mgmt stewards:vmx"] will be updated in-place
  ~ resource "github_team_membership" "this" {
        id       = "6630975:vmx"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

Plan: 13 to add, 3 to change, 13 to destroy.
```

</details>
<!-- Sticky Pull Request Commentplan -->